In [ ]:
Explaination

***Reading the csv file***

In [4]:
import  pandas as pd # data operation 
import numpy as np # math operation 
import matplotlib.pyplot as plt # Diagram/ plots
import seaborn as sns # Diagram/ plots

In [ ]:
# data set name: visadataset
# read csv file : comma sapareated value 
# extention : .csv
# you can read this using pandas package 
# read excel file 
# Extention: .xlsx

In [8]:
path=r"C:\Users\piyus\OneDrive\Data_Files\visadataset.csv"
pd.read_csv(path)

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,77092.5700,Year,Y,Certified
25476,EZYV25477,Asia,High School,Y,N,3274,2006,Northeast,279174.7900,Year,Y,Certified
25477,EZYV25478,Asia,Master's,Y,N,1121,1910,South,146298.8500,Year,N,Certified
25478,EZYV25479,Asia,Master's,Y,Y,1918,1887,West,86154.7700,Year,Y,Certified
25479,EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwest,70876.9100,Year,Y,Certified

In [10]:
path=r"C:\Users\piyus\OneDrive\Data_Files\bank.csv"
pd.read_csv(path)

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,30,unemployed,married,primary,no,1787,no,no,cellular,19,oct,79,1,-1,0,unknown,no
1,33,services,married,secondary,no,4789,yes,yes,cellular,11,may,220,1,339,4,failure,no
2,35,management,single,tertiary,no,1350,yes,no,cellular,16,apr,185,1,330,1,failure,no
3,30,management,married,tertiary,no,1476,yes,yes,unknown,3,jun,199,4,-1,0,unknown,no
4,59,blue-collar,married,secondary,no,0,yes,no,unknown,5,may,226,1,-1,0,unknown,no
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4516,33,services,married,secondary,no,-333,yes,no,cellular,30,jul,329,5,-1,0,unknown,no
4517,57,self-employed,married,tertiary,yes,-3313,yes,yes,unknown,9,may,153,1,-1,0,unknown,no
4518,57,technician,married,secondary,no,295,no,no,cellular,19,aug,151,11,-1,0,unknown,no
4519,28,blue-collar,married,secondary,no,1137,no,no,cellular,6,feb,129,4,211,3,other,no
4520,44,entrepreneur,single,tertiary,no,1136,yes,yes,cellular,3,apr,345,2,249,7,other,no

***Create datafraame ussing list***

In [11]:
name=['Ramesh', 'Suresh', 'Satish']
age=[30,35,40]
name,age

(['Ramesh', 'Suresh', 'Satish'], [30, 35, 40])

In [17]:
pd.DataFrame() # make the data frame

Empty DataFrame
Columns: []
Index: []

In [16]:
import  pandas as pd
pd.DataFrame(zip(name,age))

        0   1
0  Ramesh  30
1  Suresh  35
2  Satish  40

In [18]:
data=zip(name,age)
c1=['name','age']
pd.DataFrame(data,columns=c1)

     name  age
0  Ramesh   30
1  Suresh   35
2  Satish   40

In [ ]:
provide index

In [22]:
data=zip(name,age)
c1=['name','age']
indexx=['A','B','C']
pd.DataFrame(data,columns=c1,index=indexx)

     name  age
A  Ramesh   30
B  Suresh   35
C  Satish   40

$step-5$
**Add_new_Cloumns**

In [24]:
name=['Ramesh', 'Suresh', 'Satish']
age=[30,35,40]
data=zip(name,age)
c1=['name','age']
Df=pd.DataFrame(data,columns=c1)
Df

     name  age
0  Ramesh   30
1  Suresh   35
2  Satish   40

- if you want to add a new column
- Df['new element']
- you need to have a list which is having some elements
- that element need tequal to number of row.
- c_name=['Hyd','Blr','channai']
- Df['city']=c_name

In [30]:
c_name=['Hyd','Blr','channai']
Df['city']=c_name
Df

     name  age     city
0   ashif   30      Hyd
1  piyush   35      Blr
2   swami   40  channai

***Step-6***
$Update$ $the$ $existing$ $column$
- if you want to new column and update  the old column 
- both are same way

In [31]:
c_name=['Hyd','Blr','channai']
Df['name']=['ashif', 'piyush','swami']
Df

     name  age     city
0   ashif   30      Hyd
1  piyush   35      Blr
2   swami   40  channai

Step-7 
- Drop the column 
- in order to drop the column 
- we need tto use drop methode
- it takes 3 parameters
  - drop column or row 
  - mention the column name 
  - axis 
      - axis=1 referance as column 
      - axis=0 referance as row
  - you  want to create a new datafeame or 
  - you want overwrite the existing dataframe
      - inplace=True

In [32]:
Df.drop('city',axis=1,inplace=True)
Df

     name  age
0   ashif   30
1  piyush   35
2   swami   40

In [34]:
Df.drop(2,axis=0,inplace=True)
Df

     name  age
0   ashif   30
1  piyush   35

In [35]:
data=zip(name,age)
c1=['name','age']
indexx=['A','B','C']
df=pd.DataFrame(data,columns=c1,index=indexx)
df

     name  age
A  Ramesh   30
B  Suresh   35
C  Satish   40

In [37]:
df.drop('C',axis=0,inplace=True)
df

     name  age
A  Ramesh   30
B  Suresh   35

In [56]:
df.to_csv('C:\Users\piyus\OneDrive\Data_Files\output1.csv')
df.to_excel('C:\Users\piyus\OneDrive\Data_Files\output1.xlsx')

SyntaxError: (unicode error) 'unicodeescape' codec can't decode bytes in position 2-3: truncated \UXXXXXXXX escape (608333457.py, line 1)

In [42]:
df.to_csv("output.csv",index=False)
df

  Unnamed: 0    name  age
0          A  Ramesh   30
1          B  Suresh   35

In [39]:
df=pd.read_csv('output.csv')
df

  Unnamed: 0    name  age
0          A  Ramesh   30
1          B  Suresh   35

In [ ]:
- To solve the above problem we can use index=False

In [38]:
df.to_csv("output.csv",index=False)
df

  Unnamed: 0    name  age
0          A  Ramesh   30
1          B  Suresh   35

In [35]:
pd.read_csv('output.csv')

  Unnamed: 0    name  age
0          A  Ramesh   30
1          B  Suresh   35

In [4]:
d1={'name':['Ramesh', 'Suresh', 'Satish'],'age':[30,20,40]}
pd.DataFrame(d1)
# no need of zip 
# no need of column names

     name  age
0  Ramesh   30
1  Suresh   20
2  Satish   40

In [9]:
import pandas as pd
d1={'name':['Ramesh', 'Suresh', 'Satish'],'age':[30,20,40]}
index1=['A','B','C']
D1=pd.DataFrame(d1,index=index1)
D1

     name  age
A  Ramesh   30
B  Suresh   20
C  Satish   40

In [10]:
D1.drop('A',axis=0, inplace=True)
D1

     name  age
B  Suresh   20
C  Satish   40

In [ ]:
"output.csv"

In [43]:
import pandas as pd
d1={'name':['Ramesh', 'Suresh', 'Satish'],'age':[30,20,40]}
index1=['A','B','C']
D1=pd.DataFrame(d1,index=index1)
D1

     name  age
A  Ramesh   30
B  Suresh   20
C  Satish   40

$Step-10$
# Remove The Index

In [85]:
D1.to_csv("output_Second.csv",index=False)
D1

  City  Visit
0  Hyd   1997
1  Pat   1990
2  Del   1989

In [86]:
pd.read_csv("output_Second.csv")

  City  Visit
0  Hyd   1997
1  Pat   1990
2  Del   1989

In [88]:
pd.read_csv("output_Second.csv")

  City  Visit
0  Hyd   1997
1  Pat   1990
2  Del   1989

In [59]:
d1={'City':['Hyd', 'Pat', 'Del'],'Visit':[1997,1990,1989]}
D1=pd.DataFrame(d1)
D1

  City  Visit
0  Hyd   1997
1  Pat   1990
2  Del   1989

In [95]:
D1.to_excel("P1.xlsx",index=False)

In [96]:
pd.read_excel("P1.xlsx")

  City  Visit
0  Hyd   1997
1  Pat   1990
2  Del   1989

In [65]:
City=['Hyd', 'Pat', 'Del']
Visit=[1997,1990,1989]
data=zip(City,Visit)
c1=['City','Visit']
indexx=['A','B','C']
df=pd.DataFrame(data,columns=c1,index=indexx)
df

  City  Visit
A  Hyd   1997
B  Pat   1990
C  Del   1989

In [69]:
df.drop('City',axis=1, inplace=True)
df

   Visit
A   1997
B   1990
C   1989

In [70]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, A to C
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Visit   3 non-null      int64
dtypes: int64(1)
memory usage: 48.0+ bytes

In [72]:
df.shape

(3, 1)

In [73]:
D1.shape

(3, 2)

In [74]:
D1.describe

<bound method NDFrame.describe of   City  Visit
0  Hyd   1997
1  Pat   1990
2  Del   1989>

In [76]:
City=['Hyd', 'Pat', 'Del']
Visit=[1997,1990,1989]
data=zip(City,Visit)
c1=['City','Visit']
indexx=['A','B','C']
df=pd.DataFrame(data,columns=c1,index=indexx)
df

  City  Visit
A  Hyd   1997
B  Pat   1990
C  Del   1989

In [77]:
pwd

'C:\\Users\\piyus\\OneDrive\\DATA SCIENCE( 2024)\\EDA'

In [97]:
d1={'City':['Hyd', 'Pat', 'Del'],'Visit':[1997,1990,1989]}
D1=pd.DataFrame(d1)
D1

  City  Visit
0  Hyd   1997
1  Pat   1990
2  Del   1989

In [98]:
D1['name']=['ashif', 'piyush','swami']
D1

  City  Visit    name
0  Hyd   1997   ashif
1  Pat   1990  piyush
2  Del   1989   swami

In [99]:
D1['Visit']=[2000,2005,2007]
D1

  City  Visit    name
0  Hyd   2000   ashif
1  Pat   2005  piyush
2  Del   2007   swami

In [101]:
D1.drop(1,axis=0,inplace=True)
D1

  City  Visit   name
0  Hyd   2000  ashif
2  Del   2007  swami

$take-loc-iloc$

In [5]:
df.take([2,3,4])

NameError: name 'df' is not defined